# InstanceMoveTopWithGrids Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InstanceMoveTopWithGrids Property
ParameterTypeId Class See Also
---
"Move Top With Grids"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InstanceMoveTopWithGrids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceMoveTopWithGrids As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InstanceMoveTopWithGrids {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace